Revit 2027 API
Application.NewXYZ(Double, Double, Double) Method
Creates a XYZ object representing coordinates in 3-space with supplied values.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ NewXYZ(
	double x,
	double y,
	double z
)
Public Function NewXYZ (
	x As Double,
	y As Double,
	z As Double
) As XYZ
public:
XYZ^ NewXYZ(
	double x,
	double y,
	double z
)
member NewXYZ :
        x : float *
        y : float *
        z : float -> XYZ
Parameters
x Double
The first coordinate.
y Double
The second coordinate.
z Double
The third coordinate.
Return Value
XYZ
Exceptions
Exception | Condition
ArgumentException |  Thrown when setting an infinite number to the X, Y or Z property.
See Also
Reference
Application Class
NewXYZ Overload
Autodesk.Revit.Creation Namespace